import numpy as np
# a = np.array([1,2,3,4,5,6,7,8,9,10,11,12])
# a_2d = a.reshape(3,4)
# print(a_2d)
# print('\n')
# a_2d_col = a.reshape(3,4, order='F')
# print(a_2d_col)
# print('\n')
# a_3d = a.reshape(3,2,2)
# print(a_3d)
# print('\n')
# a_3d = a.reshape(3,2,2, order='F')
# print(a_3d)
# print('\n')
#


#二維陣列


a = np.array([[11,12,13],[23,24,25],[34,35,36]])  # 二維陣列
print(a)
print('-----------')
print('') #空一行
print('-----------')
print('取第一列',a[1]) #取第一列
print('-----------')
print('取第1列到最後列''\n',a[1:]) #取第1列到最後列
print('-----------')
print('取第1列,從第1列裡第1個元素到最後',a[1][1:]) #取第1列,從第1列裡第1個元素到最後
print('-----------')
print('')
print('-----------')
#比較特別的寫法
print ('#...代表省略”列”, 取出第一行''\n',a[...,1])  #...代表省略”列”, 取出第一行
print('-----------')
print ('取出第一列, 省略”行”''\n',a[1,...]) #取出第一列, 省略”行”
print('-----------')
print (' ...代表省略”列”,取出第一行後的所有行''\n',a[...,1:]) # ...代表省略”列”,取出第一行後的所有行
